---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.ExessiveBeltDistance
source: html/8b20a18b-a810-6fc8-afd5-f35b650dc3fa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.ExessiveBeltDistance Property

The requested Measurement Line Offset would place the put the Measurement Line of the face boundaries.

## Syntax (C#)
```csharp
public static FailureDefinitionId ExessiveBeltDistance { get; }
```